src/Работа_С_Заказами/Catalogs/ГруппыРассылокИОповещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>ГруппыРассылокИОповещений</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьКонтактномуЛицуОбъектаОповещения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХраненияСообщений</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьПартнеру</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьКонтактнымЛицамРоли</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольКонтактногоЛица</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиКонтактныхЛицПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенаДляЭлектронныхПисем</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтактнойИнформацииПартнераДляПисем</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтактнойИнформацииКонтактногоЛицаДляПисем</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенаДляSMS</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтактнойИнформацииПартнераДляSMS</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтактнойИнформацииКонтактногоЛицаДляSMS</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Работа_С_Заказами/Catalogs/ГруппыРассылокИОповещений/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура Работа_С_Заказами_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если О_Работа_С_Заказами.ЭтоПредопределеннаяГруппаРассылокИОповещений(Объект.Ссылка) Тогда
		Элементы.Наименование.ТолькоПросмотр									= Истина;
		Элементы.ТипПодписки.ТолькоПросмотр										= Истина;
		Элементы.ОтправлятьПартнеру.ТолькоПросмотр								= Истина;
		Элементы.ОтправлятьКонтактнымЛицамРоли.ТолькоПросмотр					= Истина;
		Элементы.ОтправлятьКонтактномуЛицуОбъектаОповещения.ТолькоПросмотр		= Истина;
		Элементы.ПредназначенаДляЭлектронныхПисем.ТолькоПросмотр				= Истина;
		Элементы.ВидКонтактнойИнформацииПартнераДляПисем.ТолькоПросмотр			= Истина;
		Элементы.ВидКонтактнойИнформацииКонтактногоЛицаДляПисем.ТолькоПросмотр	= Истина;
		Элементы.ВидКонтактнойИнформацииКонтактногоЛицаДляSMS.ТолькоПросмотр	= Истина;
		Элементы.ВидКонтактнойИнформацииПартнераДляSMS.ТолькоПросмотр			= Истина;
		Элементы.ПредназначенаДляSMS.ТолькоПросмотр								= Истина;
		Элементы.Ответственный.ТолькоПросмотр									= Истина;
		Элементы.НастроитьОтправкуSMS.Видимость									= Ложь;
		Элементы.СоздатьРассылку.Видимость										= Ложь;
		Элементы.СоздатьВидОповещения.Видимость									= Ложь;
		Элементы.СоздатьПодписку.Видимость										= Ложь;
		Элементы.УдалятьСозданныеСообщения.Видимость							= Ложь;
		Элементы.СрокХраненияСообщений.Видимость								= Ложь;
	КонецЕсли;
КонецПроцедуры
